RhinoInside.Revit API Documentation
GeometryDecoder.ToBoundingBox Method (Outline)
 Converts the specified Outline to an equivalent Rhino BoundingBox.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8015
Syntax
public static BoundingBox ToBoundingBox(
	this Outline value
)
Parameters
value
Type: Outline
A value to convert.
Return Value
Type: BoundingBox
A Rhino BoundingBox that is equivalent to the provided value.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Outline. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
GeometryDecoder Class
ToBoundingBox Overload
RhinoInside.Revit.Convert.Geometry Namespace